html/steemblupaper.org
#+TITLE: Papier bleu de Steem ([[https://steem.io/steem-bluepaper.pdf][Steem bluepaper]])
#+AUTHOR: Laurent Garnier

Un protocole pour permettre une monnaie sociale intelligente pour les
éditeurs et les entreprises de contenu à travers l'Internet.

* Introduction
  Steem fournit un protocole[fn:1] de chaîne de blocs (blockchain)
  évolutif pour un contenu accessible publiquement et immuable, ainsi
  qu'un jeton numérique rapide et sans frais appelé STEEM[fn:2]) ce
  qui permet aux gens de gagner de la monnaie (STEEM) en utilisant
  leur cerveau (ce qu'on peut appeler "Preuve de cerveau"
  [Proof-of-Brain]). Les deux blocs de construction de ce protocole, à
  la fois la chaîne de blocs et le jeton, dépendent l'un de l'autre
  pour la sécurité, l'immuabilité et la longévité, et sont donc partie
  intégrante de l'existence de chacun. Steem a fonctionné avec succès
  pendant plus d'un an, et a maintenant dépassé Bitcoin et Ethereum en
  nombre de transactions traitées.[fn:3]

  Comparé à d'autres chaînes de blocs, Steem se distingue comme la première
  base de données accessible au public pour du contenu stocké de façon
  immuable sous la forme de texte brut, avec un mécanisme d'incitation
  intégré. Cela fait de Steem une plate-forme de publication publique
  à partir de laquelle toute application Internet peut tirer et
  partager des données tout en récompensant ceux qui contribuent au
  contenu le plus précieux. 

  Dans le domaine des crypto-monnaies, les propriétés uniques de STEEM
  le rendent à la fois «intelligente» et «sociale» par rapport à
  d'autres, comme le bitcoin et l'éther. Cela provient de deux
  nouvelles fonctionnalités du jeton. La première est une piscine de
  jetons (pool of tokens) dédiés à la création de contenu et à la
  conservation (appelé «piscine de récompenses» ["rewards pool"]). La
  seconde est un système de vote qui tire parti de la sagesse de la
  foule pour évaluer la valeur du contenu et distribuer des jetons à
  celui-ci. Ces deux propriétés uniques lorsqu'elles sont combinées
  sont appelées Preuve de Cerveau, ce qui est un principe basé sur la
  Preuve de Travail (Proof-of-Work),[fn:4] déstiné à insister sur le
  travail humain requis pour distribuer des jetons aux participants de
  la communauté. La preuve de cerveau positionne STEEM comme un outil
  pour construire des communautés en perpétuelle croissance, qui
  encouragent leurs membres à ajouter de la valeur à la communauté
  grâce à la structure de récompenses intégrée. 

  En plus de ces progrès dans la technologie de la chaîne de bloc et des jetons,
  Steem en tant que système fournit des fonctionnalités avancées
  supplémentaires pour améliorer l'expérience de l'utilisateur, comme
  la récupération de compte volé[fn:5], les services d'entiercement[fn:6],
  le contenu favorisé par l'utilisateur et les comptes d'épargne. Tout
  cela est fait tout en fournissant aux utilisateurs trois fois le
  temps de confirmation et zéro frais sur toutes les
  transactions. Tout cela lui permet de soutenir la mission d'apporter
  une monnaie intelligente et sociale aux éditeurs et bâtisseurs de
  communautés sur Internet. 










* Preuve de Cerveau : Jetons Intelligents et Sociaux
  Les systèmes de jetons qui récompensent les utilisateurs lorsqu'ils
  contribuent à un système de communauté basé sur des jetons
  nécessitent des mécanismes pour établir et évaluer la valeur sociale
  du contenu: nous appelons cela «preuve de cerveau».
