html/steemblupaper.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-15 Mon 22:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Papier bleu de Steem (<a href="https://steem.io/steem-bluepaper.pdf">Steem bluepaper</a>)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Laurent Garnier" />
</head>
<body>
<div id="content">
<h1 class="title">Papier bleu de Steem (<a href="https://steem.io/steem-bluepaper.pdf">Steem bluepaper</a>)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3d128fb">1. Introduction</a></li>
<li><a href="#orgac6b26a">2. Preuve de Cerveau : Jetons Intelligents et Sociaux</a>
<ul>
<li><a href="#orgbe4dd93">2.1. La piscine de récompenses ("D'où les jetons viennent-ils ?")</a></li>
<li><a href="#orgdff7506">2.2. Récompenses pour les créateurs de contenu et les conservateurs</a></li>
<li><a href="#org2f1d766">2.3. Voter avec des jetons jalonnés pour déterminer l'attribution des récompenses</a></li>
</ul>
</li>
<li><a href="#org4c93c0c">3. Vitesse et échelle sur la Blockchain Steem</a>
<ul>
<li><a href="#orgf168ed7">3.1. La preuve de participation déléguée (DPoS)</a></li>
<li><a href="#org302808e">3.2. Chaîne de base (ChainBase)</a></li>
<li><a href="#orge1185fc">3.3. AppBase</a></li>
</ul>
</li>
<li><a href="#org0c88f09">4. Fonctionnalités de la plate-forme Steem</a>
<ul>
<li><a href="#org1f2bd22">4.1. Primitives conçues pour les applications de contenu</a></li>
<li><a href="#org1126347">4.2. Système de nom natif</a></li>
<li><a href="#org8c5a391">4.3. Steem Blockchain Dollars (SBD)</a></li>
<li><a href="#org9fb03cb">4.4. Echange décentralisé</a></li>
<li><a href="#org66c2f70">4.5. Paiements par l'intermédiaire de l'entiercement</a></li>
<li><a href="#org8cf17f7">4.6. Structure de clé privée hiérarchique</a></li>
<li><a href="#orgd834bee">4.7. Autorités Multi Sig</a></li>
<li><a href="#org5853f07">4.8. Bénéficiaires de récompenses multiples</a></li>
<li><a href="#org42e5c48">4.9. Jetons de média intelligents (Smart Media Tokens)</a></li>
<li><a href="#org13a4b54">4.10. Récupération de compte volé</a></li>
<li><a href="#orgb5187b4">4.11. Sécurité à travers les serrures de temps</a></li>
<li><a href="#orgb15fbe4">4.12. Limitation du débit de bande passante pour les opérations sans frais</a></li>
</ul>
</li>
<li><a href="#org8f5fcad">5. Conclusion</a></li>
</ul>
</div>
</div>
<p>
Un protocole pour permettre une monnaie sociale intelligente pour les
éditeurs et les entreprises de contenu à travers l'Internet.
</p>

<div id="outline-container-org3d128fb" class="outline-2">
<h2 id="org3d128fb"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Steem fournit un protocole<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> de chaîne de blocs (blockchain)
évolutif pour un contenu accessible publiquement et immuable, ainsi
qu'un jeton numérique rapide et sans frais appelé STEEM<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>) ce
qui permet aux gens de gagner de la monnaie (STEEM) en utilisant
leur cerveau (ce qu'on peut appeler "Preuve de cerveau"
[Proof-of-Brain]). Les deux blocs de construction de ce protocole, à
la fois la chaîne de blocs et le jeton, dépendent l'un de l'autre
pour la sécurité, l'immuabilité et la longévité, et sont donc partie
intégrante de l'existence de chacun. Steem a fonctionné avec succès
pendant plus d'un an, et a maintenant dépassé Bitcoin et Ethereum en
nombre de transactions traitées.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>

<p>
Comparé à d'autres chaînes de blocs, Steem se distingue comme la première
base de données accessible au public pour du contenu stocké de façon
immuable sous la forme de texte brut, avec un mécanisme d'incitation
intégré. Cela fait de Steem une plate-forme de publication publique
à partir de laquelle toute application Internet peut tirer et
partager des données tout en récompensant ceux qui contribuent au
contenu le plus précieux. 
</p>

<p>
Dans le domaine des crypto-monnaies, les propriétés uniques de STEEM
le rendent à la fois «intelligente» et «sociale» par rapport à
d'autres, comme le bitcoin et l'éther. Cela provient de deux
nouvelles fonctionnalités du jeton. La première est une piscine de
jetons (pool of tokens) dédiés à la création de contenu et à la
conservation (appelé «piscine de récompenses» ["rewards pool"]). La
seconde est un système de vote qui tire parti de la sagesse de la
foule pour évaluer la valeur du contenu et distribuer des jetons à
celui-ci. Ces deux propriétés uniques lorsqu'elles sont combinées
sont appelées Preuve de Cerveau, ce qui est un principe basé sur la
Preuve de Travail (Proof-of-Work),<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> déstiné à insister sur le
travail humain requis pour distribuer des jetons aux participants de
la communauté. La preuve de cerveau positionne STEEM comme un outil
pour construire des communautés en perpétuelle croissance, qui
encouragent leurs membres à ajouter de la valeur à la communauté
grâce à la structure de récompenses intégrée. 
</p>

<p>
En plus de ces progrès dans la technologie de la chaîne de bloc et des jetons,
Steem en tant que système fournit des fonctionnalités avancées
supplémentaires pour améliorer l'expérience de l'utilisateur, comme
la récupération de compte volé<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>, les services d'entiercement<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>,
le contenu favorisé par l'utilisateur et les comptes d'épargne. Tout
cela est fait tout en fournissant aux utilisateurs trois fois le
temps de confirmation et zéro frais sur toutes les
transactions. Tout cela lui permet de soutenir la mission d'apporter
une monnaie intelligente et sociale aux éditeurs et bâtisseurs de
communautés sur Internet. 
</p>
</div>
</div>










<div id="outline-container-orgac6b26a" class="outline-2">
<h2 id="orgac6b26a"><span class="section-number-2">2</span> Preuve de Cerveau : Jetons Intelligents et Sociaux</h2>
<div class="outline-text-2" id="text-2">
<p>
Les systèmes de jetons qui récompensent les utilisateurs lorsqu'ils
contribuent à un système de communauté basé sur des jetons
nécessitent des mécanismes pour établir et évaluer la valeur sociale
du contenu: nous appelons cela «preuve de cerveau».
</p>
</div>
