html/steemblupaper.org
** La piscine de récompenses ("D'où les jetons viennent-ils ?")
   L'un des aspects les plus innovants (et des plus mal compris) de la
   chaîne de blocs Steem est la "piscine de récompenses" à partir de
   laquelle les jetons sont distribués aux créateurs de contenu de
   valeur. Afin de comprendre ce qu'est la piscine de récompenses, il
   faut d'abord comprendre que les jetons sont produits différemment
   dans les chaînes de blocs DPoS[fn:7] qu'ils ne le sont dans les
   chaînes de blocs PoW (Preuve de Travail). Dans les chaînes de blocs PoW
   traditionnelles, les jetons sont produits régulièrement mais
   distribués aléatoirement aux personnes dont les machines effectuent
   un travail ("les mineurs"). 

   Différent des crypto-monnaies de type PoW, les jetons de Steem sont
   générés à un taux fixe d'un bloc toutes les trois secondes. Ces
   jetons sont distribués aux différents acteurs du système selon les
   règles définies par la chaîne de blocs. Ces acteurs, tels que les
   créateurs de contenu, les témoins et les conservateurs
   (organisateurs ?[fn:8]), rivalisent de manière spécialisée pour les
   jetons. Contrairement aux moyens traditionnels de distribution de
   PoW, où les mineurs rivalisent sur la puissance informatique brute,
   les acteurs du réseau Steem sont incités à être compétitifs de
   manière à ajouter de la valeur au réseau.

   Le taux de génération de nouveaux jetons a été fixé à 9,5% par an à
   compter de décembre 2016, et diminue à raison de 0,01% tous les 250
   000 blocs, soit environ 0,5% par an. L'inflation continuera à
   décroître à ce rythme jusqu'à atteindre 0,95%, après une période
   d'environ 20,5 ans.

   De l'offre de nouveaux jetons créés par la chaîne de blocs Steem chaque
   année, 75% de ces jetons composent la «piscine de récompenses» qui sont
   distribués aux créateurs de contenu et aux conservateurs de
   contenu. 15% sont distribués aux détenteurs de jetons acquis, et
   10% sont distribués aux Témoins, les producteurs de blocs coopérant
   au protocole de consensus DPoS de Steem.

** Récompenses pour les créateurs de contenu et les conservateurs   
   Les utilisateurs qui produisent du contenu ajoutent de la valeur au
   réseau en créant du matériel qui attirera de nouveaux utilisateurs
   vers la plateforme, tout en maintenant l'engagement et le
   divertissement des utilisateurs existants. Cela facilite la
   distribution de la monnaie à un plus grand nombre d'utilisateurs et
   augmente l'effet de réseau. Les utilisateurs qui prennent le temps
   d'évaluer et de voter pour le contenu jouent un rôle important dans
   la distribution de la devise aux utilisateurs qui ajoutent le plus
   de valeur. La chaîne de blocs récompense ces deux activités par rapport
   à leur valeur sur la base de la sagesse collective de la foule
   rassemblée à travers le système de vote pondéré par les parts.
** Voter avec des jetons jalonnés pour déterminer l'attribution des récompenses
   Steem opère sur la base de un-STEEM, un vote. Selon ce modèle, les
   personnes qui ont le plus contribué à la plateforme, selon le solde
   de leur compte, ont le plus d'influence sur la façon dont les
   contributions sont évaluées. L'enjeu peut être acheté ou gagné. Les
   utilisateurs ne peuvent pas acquérir une influence supplémentaire
   en possédant plusieurs comptes, car un même compte avec un montant
   de participation aura la même influence que deux comptes différents
   partageant le même montant de participation. Le seul moyen pour les
   utilisateurs d'accroître leur influence sur la plateforme est
   d'augmenter leur participation.

   En outre, Steem ne permet pas aux membres de voter avec STEEM quand il
   est engagé à un calendrier d'acquisition de 13 semaines appelé
   Steem Power. Selon ce modèle, les membres ont une incitation
   financière à voter de manière à maximiser la valeur à long terme de
   leur STEEM.
* Vitesse et échelle sur la Blockchain Steem
  La chaîne de blocs Steem est conçue pour être l'une des chaînes de blocs
  les plus rapides et les plus efficaces, ce qui est nécessaire pour
  supporter la quantité de trafic attendue sur une plate-forme de
  médias sociaux plus grande que la taille de Reddit. Steem a déjà
  dépassé Bitcoin en nombre de transactions, et est capable d'évoluer
  pour prendre en charge 10 000 transactions ou plus par seconde.
