html/steemblupaper.org
** La preuve de participation déléguée (DPoS)
   Souvent engorgées par la preuve de travail (PoW)[fn:9], de
   nombreuses chaînes de blocs ne peuvent pas s'étendre au-delà de
   trois transactions par secondes, ce qui est une fraction du trafic
   financier mondial. Steem avait besoin d'une bien plus grande
   échelle et vitesse que celle offerte par PoW, et ainsi un
   algorithme moins connu appelé Preuve de Participation Déléguée
   (DPoS)[fn:10] a été mis à profit pour jeter les bases d'une
   chaîne de blocs adaptée à des milliards d'utilisateurs. 

   Grâce au DPoS, la chaîne de blocs Steem est capable de générer un nouveau
   bloc toutes les 3 secondes avec une charge de calcul minimale. Cela
   signifie que la chaîne de blocs peut traiter plus de transactions et
   contenir plus d'informations, y compris du contenu.

   En définissant les règles pour le cas où un Hardfork se produit,
   les témoins élus dans le cadre DPoS peuvent rapidement et
   efficacement décider d'aller de l'avant avec une proposition
   de hardfork, permettant au protocole chaîne de blocs Steem d'évoluer plus
   rapidement que la plupart des autres. La chaîne de blocs Steem a déjà
   bifurquée 18 fois[fn:11], et chaque fois qu'un Hardfork s'est
   produit, une seule chaîne a persisté après la bifurcation.
** Chaîne de base (ChainBase)
   ChainBase[fn:12] est la partie de la base de données de la pile
   de chaîne de blocs et qui a remplacé Graphene[fn:13]
   en 2016. ChainBase a des temps de chargement et de sortie plus
   rapides, prend en charge l'accès parallèle à la base de données et
   est plus robuste contre les plantages que son prédécesseur.La
   corruption de la base de données est également moins fréquente,
   elle permet un "instantané" instantané de l'état de la base de
   données et peut servir plus de requêtes RPC à partir de la même
   mémoire.  
** AppBase
   AppBase est la première étape dans la création d'une FABRIC
   multi-chaîne. AppBase permet à de nombreux composants de la chaîne
   de blocs Steem de devenir modulaire en créant des chaînes de blocs
   supplémentaires sans consensus comme greffons (plugins) dédiés. Ces
   greffons peuvent être mis à jour beaucoup plus rapidement parce
   qu'ils n'ont pas besoin de rejouer la chaîne de blocs en
   entier. Cela rend steemd[fn:14] beaucoup plus efficace et facile à
   maintenir et à étendre.

   En pratique, AppBase permet à différents cœurs, ou même à
   différents ordinateurs, de maintenir différentes parties de la
   chaîne de blocs Steem. Cela est significativement plus efficace que
   de nécessiter que chaque coeur, et chaque ordinateur du réseau
   maintienne l'entière chaîne de blocs. Modulariser la chaîne de
   blocs permet de tirer pleinement parti de la nature modulaire des
   ordinateurs. Cela est un pas nécessaire dans le long processus de
   création d'une chaîne de blocs entièrement parallèle, entièrement
   optimisée. 
* Fonctionnalités de la plate-forme Steem
  La chaîne de blocs Steem sert un double but d'être à la fois un système de
  traitement de jeton numérique, et une plate-forme de média social de
  masse. Les fonctionnalités offertes par la chaîne de blocs
  nécessitent de soutenir les deux buts, et de fournir aux
  utilisateurs une experience de classe mondiale lorsqu'ils utilisent
  chacun des aspects de la plate-forme.
** Primitives conçues pour les applications de contenu
   Steem offre aux utilisateurs la possibilité unique de publier et
   stocker différents types de contenus directement et de façon
   permanente à l'intérieur du registre immuable de la chaîne de blocs
   en tant que texte brute. Une fois stockées dans la chaîne de blocs,
   les données deviennent disponibles publiquement pour les
   développeurs pour construire avec. Les développeurs sont capables
   d'intéragir avec le contenu directement dans la chaîne de blocs en
   utilisant les APIs[fn:15] disponibles. Plusieurs développeurs de
   primitives de la chaîne de blocs peuvent construire à partir de noms de
   compte, messages, commentaires, votes et solde de compte.
