html/steemblupaper.html
<div id="outline-container-orgf168ed7" class="outline-3">
<h3 id="orgf168ed7"><span class="section-number-3">3.1</span> La preuve de participation déléguée (DPoS)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Souvent engorgées par la preuve de travail (PoW)<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup>, de
nombreuses chaînes de blocs ne peuvent pas s'étendre au-delà de
trois transactions par secondes, ce qui est une fraction du trafic
financier mondial. Steem avait besoin d'une bien plus grande
échelle et vitesse que celle offerte par PoW, et ainsi un
algorithme moins connu appelé Preuve de Participation Déléguée
(DPoS)<sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup> a été mis à profit pour jeter les bases d'une
chaîne de blocs adaptée à des milliards d'utilisateurs. 
</p>

<p>
Grâce au DPoS, la chaîne de blocs Steem est capable de générer un nouveau
bloc toutes les 3 secondes avec une charge de calcul minimale. Cela
signifie que la chaîne de blocs peut traiter plus de transactions et
contenir plus d'informations, y compris du contenu.
</p>

<p>
En définissant les règles pour le cas où un Hardfork se produit,
les témoins élus dans le cadre DPoS peuvent rapidement et
efficacement décider d'aller de l'avant avec une proposition
de hardfork, permettant au protocole chaîne de blocs Steem d'évoluer plus
rapidement que la plupart des autres. La chaîne de blocs Steem a déjà
bifurquée 18 fois<sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup>, et chaque fois qu'un Hardfork s'est
produit, une seule chaîne a persisté après la bifurcation.
</p>
</div>
</div>
<div id="outline-container-org302808e" class="outline-3">
<h3 id="org302808e"><span class="section-number-3">3.2</span> Chaîne de base (ChainBase)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
ChainBase<sup><a id="fnr.12" class="footref" href="#fn.12">12</a></sup> est la partie de la base de données de la pile
de chaîne de blocs et qui a remplacé Graphene<sup><a id="fnr.13" class="footref" href="#fn.13">13</a></sup>
en 2016. ChainBase a des temps de chargement et de sortie plus
rapides, prend en charge l'accès parallèle à la base de données et
est plus robuste contre les plantages que son prédécesseur.La
corruption de la base de données est également moins fréquente,
elle permet un "instantané" instantané de l'état de la base de
données et peut servir plus de requêtes RPC à partir de la même
mémoire.  
</p>
</div>
</div>
<div id="outline-container-orge1185fc" class="outline-3">
<h3 id="orge1185fc"><span class="section-number-3">3.3</span> AppBase</h3>
<div class="outline-text-3" id="text-3-3">
<p>
AppBase est la première étape dans la création d'une FABRIC
multi-chaîne. AppBase permet à de nombreux composants de la chaîne
de blocs Steem de devenir modulaire en créant des chaînes de blocs
supplémentaires sans consensus comme greffons (plugins) dédiés. Ces
greffons peuvent être mis à jour beaucoup plus rapidement parce
qu'ils n'ont pas besoin de rejouer la chaîne de blocs en
entier. Cela rend steemd<sup><a id="fnr.14" class="footref" href="#fn.14">14</a></sup> beaucoup plus efficace et facile à
maintenir et à étendre.
</p>

<p>
En pratique, AppBase permet à différents cœurs, ou même à
différents ordinateurs, de maintenir différentes parties de la
chaîne de blocs Steem. Cela est significativement plus efficace que
de nécessiter que chaque coeur, et chaque ordinateur du réseau
maintienne l'entière chaîne de blocs. Modulariser la chaîne de
blocs permet de tirer pleinement parti de la nature modulaire des
ordinateurs. Cela est un pas nécessaire dans le long processus de
création d'une chaîne de blocs entièrement parallèle, entièrement
optimisée. 
</p>
</div>
</div>
</div>
<div id="outline-container-org0c88f09" class="outline-2">
<h2 id="org0c88f09"><span class="section-number-2">4</span> Fonctionnalités de la plate-forme Steem</h2>
<div class="outline-text-2" id="text-4">
<p>
La chaîne de blocs Steem sert un double but d'être à la fois un système de
traitement de jeton numérique, et une plate-forme de média social de
masse. Les fonctionnalités offertes par la chaîne de blocs
nécessitent de soutenir les deux buts, et de fournir aux
utilisateurs une experience de classe mondiale lorsqu'ils utilisent
chacun des aspects de la plate-forme.
</p>
</div>
<div id="outline-container-org1f2bd22" class="outline-3">
<h3 id="org1f2bd22"><span class="section-number-3">4.1</span> Primitives conçues pour les applications de contenu</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Steem offre aux utilisateurs la possibilité unique de publier et
stocker différents types de contenus directement et de façon
permanente à l'intérieur du registre immuable de la chaîne de blocs
en tant que texte brute. Une fois stockées dans la chaîne de blocs,
les données deviennent disponibles publiquement pour les
développeurs pour construire avec. Les développeurs sont capables
d'intéragir avec le contenu directement dans la chaîne de blocs en
utilisant les APIs<sup><a id="fnr.15" class="footref" href="#fn.15">15</a></sup> disponibles. Plusieurs développeurs de
primitives de la chaîne de blocs peuvent construire à partir de noms de
compte, messages, commentaires, votes et solde de compte.
</p>
</div>
</div>
