html/steemblupaper.html
<div id="outline-container-org1126347" class="outline-3">
<h3 id="org1126347"><span class="section-number-3">4.2</span> Système de nom natif</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Les adresses de portefeuille utilisées par de nombreuses
technologies de la chaîne de blocs, telles que Bitcoin et Ethereum, se
composaient historiquement de longues chaînes de lettres et de
chiffres aléatoires. Cependant, ces adresses de portefeuille
peuvent rendre difficile la transaction avec d'autres utilisateurs
dans un contexte de média social en ligne parce que les
utilisateurs ne peuvent pas se rappeler les adresses de longue chaîne
de mémoire. La chaîne de blocs Steem utilise chaque nom
d'utilisateur comme adresse de portefeuille, ce qui renforce
l'expérience utilisateur pour les participants qui tentent
d'envoyer des jetons car ils peuvent vérifier les adresses à partir
de leur propre mémoire. 
</p>
</div>
</div>
<div id="outline-container-org8c5a391" class="outline-3">
<h3 id="org8c5a391"><span class="section-number-3">4.3</span> Steem Blockchain Dollars (SBD)</h3>
<div class="outline-text-3" id="text-4-3">
<p>
De nombreux utilisateurs initiés à la crypto-monnaie peinent à
comprendre comment les «jetons internet magiques» attribués par la
plateforme peuvent réellement avoir une valeur réelle. Afin de
combler le fossé entre les systèmes de monnaie fiduciaire plus
traditionnels auxquels les utilisateurs traditionnels sont habitués
et les jetons de crypto-monnaie qui leur sont attribués via la
plate-forme, une nouvelle monnaie appelée Steem Blockchain Dollars
(SBD) a été créée. Les jetons SBD sont conçus pour être étroitement
liés à un dollar, de sorte que les utilisateurs qui les reçoivent
peuvent savoir à peu près combien ils valent en termes de «dollars
réels». Les jetons SBD offrent également une monnaie relativement
stable aux utilisateurs s'ils veulent préserver la valeur de leur
compte par rapport à l'USD. Une explication technique plus
détaillée peut être trouvée dans le livre blanc technique de
Steem<sup><a id="fnr.16" class="footref" href="#fn.16">16</a></sup>.
</p>
</div>
</div>
<div id="outline-container-org9fb03cb" class="outline-3">
<h3 id="org9fb03cb"><span class="section-number-3">4.4</span> Echange décentralisé</h3>
<div class="outline-text-3" id="text-4-4">
<p>
La chaîne de blocs Steem offre un échange de jeton décentralisé,
similaire aux échanges de Bitshare.<sup><a id="fnr.17" class="footref" href="#fn.17">17</a></sup> L'échange permet aux
utilisateurs d'échanger leurs jetons STEEM et SBD via un marché
pair à pair public décentralisé. Les utilisateurs peuvent placer
des ordres d'achat et de vente, et l'appariement des ordres est
effectué automatiquement par la chaîne de blocs. Il existe
également un carnet de commandes accessible au public et un
historique des commandes que les utilisateurs peuvent utiliser pour
analyser le marché. Les utilisateurs peuvent interagir directement
avec l'échange en utilisant l'API de la chaîne de blocs, ou utiliser une
interface graphique telle que celle sur Steemit.com.<sup><a id="fnr.18" class="footref" href="#fn.18">18</a></sup> 
</p>
</div>
</div>
<div id="outline-container-org66c2f70" class="outline-3">
<h3 id="org66c2f70"><span class="section-number-3">4.5</span> Paiements par l'intermédiaire de l'entiercement</h3>
<div class="outline-text-3" id="text-4-5">
<p>
La nature irréversible des transactions de la chaîne de blocs est un élément
de sécurité important, bien qu'il y ait de nombreux cas où les
utilisateurs ne soient pas à l'aise pour envoyer leurs jetons à un
autre individu sans moyen de les récupérer si l'autre utilisateur
ne respecte pas leur contrat. La chaîne de blocs Steem fournit un
moyen pour les utilisateurs de s'envoyer des pièces de monnaie avec
un tiers désigné comme un service d'entiercement. L'utilisateur
agissant comme le service d'entiercement est capable de déterminer
si les termes de l'accord ont été respectés, et soit autoriser les
fonds à être remis au récepteur ou renvoyé à l'expéditeur.
</p>
</div>
</div>
