html/steemblupaper.tex
\subsection{Système de nom natif}
\label{sec:org9c571df}
Les adresses de portefeuille utilisées par de nombreuses
technologies de la chaîne de blocs, telles que Bitcoin et Ethereum, se
composaient historiquement de longues chaînes de lettres et de
chiffres aléatoires. Cependant, ces adresses de portefeuille
peuvent rendre difficile la transaction avec d'autres utilisateurs
dans un contexte de média social en ligne parce que les
utilisateurs ne peuvent pas se rappeler les adresses de longue chaîne
de mémoire. La chaîne de blocs Steem utilise chaque nom
d'utilisateur comme adresse de portefeuille, ce qui renforce
l'expérience utilisateur pour les participants qui tentent
d'envoyer des jetons car ils peuvent vérifier les adresses à partir
de leur propre mémoire. 
\subsection{Steem Blockchain Dollars (SBD)}
\label{sec:orge2b05e1}
De nombreux utilisateurs initiés à la crypto-monnaie peinent à
comprendre comment les «jetons internet magiques» attribués par la
plateforme peuvent réellement avoir une valeur réelle. Afin de
combler le fossé entre les systèmes de monnaie fiduciaire plus
traditionnels auxquels les utilisateurs traditionnels sont habitués
et les jetons de crypto-monnaie qui leur sont attribués via la
plate-forme, une nouvelle monnaie appelée Steem Blockchain Dollars
(SBD) a été créée. Les jetons SBD sont conçus pour être étroitement
liés à un dollar, de sorte que les utilisateurs qui les reçoivent
peuvent savoir à peu près combien ils valent en termes de «dollars
réels». Les jetons SBD offrent également une monnaie relativement
stable aux utilisateurs s'ils veulent préserver la valeur de leur
compte par rapport à l'USD. Une explication technique plus
détaillée peut être trouvée dans le livre blanc technique de
Steem\footnote{Steem Whitepaper \url{https://steem.io/SteemWhitePaper.pdf}}.
\subsection{Echange décentralisé}
\label{sec:org6d94add}
La chaîne de blocs Steem offre un échange de jeton décentralisé,
similaire aux échanges de Bitshare.\footnote{Bitshares Decentralized Exchange \url{http://docs.bitshares.org/\_downloads/bitshares-general.pdf}} L'échange permet aux
utilisateurs d'échanger leurs jetons STEEM et SBD via un marché
pair à pair public décentralisé. Les utilisateurs peuvent placer
des ordres d'achat et de vente, et l'appariement des ordres est
effectué automatiquement par la chaîne de blocs. Il existe
également un carnet de commandes accessible au public et un
historique des commandes que les utilisateurs peuvent utiliser pour
analyser le marché. Les utilisateurs peuvent interagir directement
avec l'échange en utilisant l'API de la chaîne de blocs, ou utiliser une
interface graphique telle que celle sur Steemit.com.\footnote{Steemit.com Currency Market \url{https://steemit.com/market}} 
\subsection{Paiements par l'intermédiaire de l'entiercement}
\label{sec:org15abc7b}
La nature irréversible des transactions de la chaîne de blocs est un élément
de sécurité important, bien qu'il y ait de nombreux cas où les
utilisateurs ne soient pas à l'aise pour envoyer leurs jetons à un
autre individu sans moyen de les récupérer si l'autre utilisateur
ne respecte pas leur contrat. La chaîne de blocs Steem fournit un
moyen pour les utilisateurs de s'envoyer des pièces de monnaie avec
un tiers désigné comme un service d'entiercement. L'utilisateur
agissant comme le service d'entiercement est capable de déterminer
si les termes de l'accord ont été respectés, et soit autoriser les
fonds à être remis au récepteur ou renvoyé à l'expéditeur.
