html/steemblupaper.org
** Structure de clé privée hiérarchique
   Steem utilise un système de clé privée hiérarchique unique en son
   genre pour faciliter les transactions à faible sécurité et haute
   sécurité. Les transactions à faible sécurité ont tendance à être
   sociales, comme l'affichage ou les commentaires. Les transactions
   de haute sécurité ont tendance à être des transferts et des
   changements de clés. Cela permet aux utilisateurs d'implémenter
   différents niveaux de sécurité pour leurs clés, en fonction de
   l'accès que les clés permettent. 

   Ces clés privées sont la Publication, Active et Propriétaire. La
   clé de publication permet aux comptes de publier, commenter,
   modifier, voter, resteem[fn:19], et suivre/rendre muet d'autres
   comptes. La clé active est destinée à des tâches plus délicates
   telles que le transfert de fonds, les transactions de montée /
   descente, la conversion de Steem Dollars, le vote de témoins, la
   passation d'ordres au marché et la réinitialisation de la clé de
   publication. La clé du propriétaire est uniquement destinée à
   être utilisée lorsque cela est nécessaire. C'est la clé la plus
   puissante car elle peut changer n'importe quelle clé d'un compte, y
   compris la clé du propriétaire, et prouver la propriété pendant une
   récupération de compte. Idéalement, elle est destinée à être stockée
   hors ligne et utilisée uniquement lorsque les clés du compte doivent
   être modifiées ou pour récupérer un compte compromis.

   Steem facilite également l'utilisation d'un mot de passe principal
   qui crypte les trois clés. Des services Web peuvent utiliser un mot de
   passe principal qui décrypte et signe avec la clé privée
   nécessaire. Les mots de passe principaux peuvent permettre aux
   utilisateurs de faire confiance à certains services pour empêcher
   le transfert de clés inappropriées sur tous les serveurs,
   augmentant ainsi l'expérience utilisateur tout en maintenant un
   environnement de signature côté client sécurisé.

** Autorités Multi Sig   
   La chaîne de blocs Steem permet à une autorité d'être divisée entre
   plusieurs entités, de sorte que plusieurs utilisateurs peuvent
   partager la même autorité, ou plusieurs entités sont nécessaires
   pour autoriser une transaction afin qu'elle soit valide. Ceci est
   fait de la même manière que Bitshares où chaque paire de clés
   publique / privée reçoit un poids, et un seuil est défini pour
   l'autorité. Pour qu'une transaction soit valide, suffisamment
   d'entités doivent signer pour que la somme de leurs poids atteigne
   ou dépasse le seuil.
   
** Bénéficiaires de récompenses multiples   
   Pour un poste donné, il peut y avoir un certain nombre de personnes
   différentes qui ont un intérêt financier dans la récompense. Cela
   inclut l'auteur, les co-auteurs possibles, les référents, les
   fournisseurs d'hébergement, les blogs qui ont intégré les
   commentaires de la chaîne de blocs et les développeurs
   d'outils. Quel que soit le site ou l'outil utilisé pour construire
   un article ou un commentaire, vous pourrez définir comment les
   récompenses de ce commentaire sont réparties entre les différentes
   parties. Cela permet diverses formes de collaboration, ainsi qu'un
   moyen pour les plates-formes qui sont construites au-dessus de la
   chaîne de blocs Steem pour collecter une partie des récompenses de leurs
   utilisateurs.

** Jetons de média intelligents (Smart Media Tokens)
   Cette couche de protocole est en cours de développement. Son livre
   blanc sera posté ici.

** Récupération de compte volé
   Si le compte d'un utilisateur est compromis, il peut changer de clé
   en utilisant sa clé privée. Dans le cas où l'attaquant est capable
   de compromettre la clé privée du propriétaire et de changer le mot
   de passe, l'utilisateur dispose de 30 jours pour soumettre une clé
   privée auparavant fonctionnelle via le processus de récupération de
   compte volé de Steem et reprendre le contrôle de son compte. Cela
   peut être offert par une personne ou une entreprise qui fournit des
   services d'enregistrement à Steem. Il n'est pas obligatoire pour le
   registraire de fournir ce service à ses utilisateurs, mais il est
   disponible pour augmenter la valeur de l'expérience des
   utilisateurs d'un registraire.
