html/steemblupaper.html
<div id="outline-container-orgb5187b4" class="outline-3">
<h3 id="orgb5187b4"><span class="section-number-3">4.11</span> Sécurité à travers les serrures de temps</h3>
<div class="outline-text-3" id="text-4-11">
<p>
Si la clé active ou propriétaire d'un utilisateur est compromise,
l'attaquant aura un accès complet à tous les fonds de son
compte. Parce que les transactions chaîne de blocs sont irréversibles,
les utilisateurs n'ont aucun moyen de récupérer leurs fonds après
avoir été volés. 
</p>

<p>
La chaîne de blocs Steem permet aux utilisateurs de stocker leurs jetons
STEEM et SBD dans un compte d'épargne, de sorte que les fonds ne
peuvent être retirés qu'après une période d'attente de trois
jours. En outre, STEEM qui est détenu dans le calendrier
d'acquisition de 13 semaines ne peut être retiré à un taux de 1/13
par semaine, après une période d'attente initiale de sept
jours. Ces verrous temporels empêchent un attaquant d'accéder
immédiatement à la totalité des fonds de l'utilisateur, de sorte
que le propriétaire légitime ait le temps de reprendre le contrôle
de son compte avant que tous ses fonds puissent être retirés.
</p>
</div>
</div>
<div id="outline-container-orgb15fbe4" class="outline-3">
<h3 id="orgb15fbe4"><span class="section-number-3">4.12</span> Limitation du débit de bande passante pour les opérations sans frais</h3>
<div class="outline-text-3" id="text-4-12">
<p>
Parce que les témoins sont entièrement payés grâce à la génération
de nouveaux jetons, il n'est pas nécessaire de facturer aux
utilisateurs des frais pour alimenter la chaîne de blocs. La seule
raison de facturer des frais aurait pour effet dissuasif d'empêcher
les utilisateurs d'effectuer un nombre déraisonnable de
transactions, ce qui pourrait avoir un impact sur la performance de
la chaîne de blocs.
</p>

<p>
Afin de placer des limites raisonnables sur l'utilisation du
système, chaque utilisateur dispose d'une bande passante
limitée. Lorsque les utilisateurs effectuent des opérations de
chaîne de blocs telles que les transferts de jetons, l'envoi de
contenu et le vote, ils utilisent une partie de leur bande
passante. Si un utilisateur dépasse sa capacité de bande passante,
il doit attendre d'effectuer des actions supplémentaires jusqu'à ce
que sa bande passante se recharge.
</p>

<p>
Les limites de bande passante s'ajustent en fonction de
l'utilisation du réseau, de sorte que les utilisateurs disposent
d'une bande passante plus importante lorsque l'utilisation du
réseau est faible. La quantité de bande passante autorisée par un
compte est directement proportionnelle à la quantité de Steem Power
dont dispose un utilisateur, de sorte que les utilisateurs peuvent
toujours augmenter leur bande passante en obtenant une puissance
Steem supplémentaire.
</p>
</div>
</div>
</div>
<div id="outline-container-org8f5fcad" class="outline-2">
<h2 id="org8f5fcad"><span class="section-number-2">5</span> Conclusion</h2>
<div class="outline-text-2" id="text-5">
<p>
Le programme unique de récompenses et d'incitations offert par la
chaîne de blocs et le token de Steem est conçu pour faire de Steem
l'ultime passerelle de crypto-monnaie pour les utilisateurs
ordinaires. La performance de la chaîne de blocs est conçue avec
l'adoption massive de la devise et de la plate-forme en
tête. Lorsqu'il est combiné avec des temps de traitement
ultra-rapides et des transactions sans frais, Steem est positionné
pour devenir l'une des principales technologies de chaîne de blocs
utilisées par les personnes autour du monde.
</p>
</div>
</div>
