html/steemblupaper.org
* Footnotes

[fn:19] "Resteem" est le terme utilisé dans la chaîne de blocs Steem
lorsqu'un utilisateur partage le contenu avec ses abonnés. 

[fn:18] Steemit.com Currency Market https://steemit.com/market

[fn:17] Bitshares Decentralized Exchange [[http://docs.bitshares.org/_downloads/bitshares-general.pdf]]

[fn:16] Steem Whitepaper [[https://steem.io/SteemWhitePaper.pdf]]

[fn:15] NdT : l'acronyme API est un peu partout présent sur internet
et comme souvent jamais traduit alors j'en profite ici : [[https://fr.wikipedia.org/wiki/Interface_de_programmation][interface de programmation]]

[fn:14] Le composant du cadre (framework) de la chaîne de blocs Steem
responsable du traitement des transactions et de la distribution des
récompenses.
 

[fn:13] Graphene Documentation [[http://docs.bitshares.org/]]

[fn:12] ChainBase Release
[[https://steemit.com/steem/@steemitblog/announcing-steem-0-14-4-shared-db-preview-release]]


[fn:11]
[[https://steemit.com/steemit/@steemitblog/proposing-hardfork-0-20-0-velocity]]


[fn:10] DPoS Whitepaper
[[https://steemit.com/dpos/@dantheman/dpos-consensus-algorithm-this-missing-white-paper]]


[fn:9] Bitcoin Scalability Problem
[[https://en.wikipedia.org/wiki/Bitcoin_scalability_problem]]


[fn:8] NdT : Les mots /[[http://www.wordreference.com/enfr/curators][curator]]/ ou /curation/ sont particulièrement
chiants à traduire.

[fn:7] NdT : DPoS: [[https://www.liskafrica.com/guides/la-preuve-de-participation-d%25C3%25A9l%25C3%25A9gu%25C3%25A9-dpos][Delegateed Proof-of-Stake]] (expliqué en français) et
[[https://hackernoon.com/explain-delegated-proof-of-stake-like-im-5-888b2a74897d][Hackernoon]] (expliqué en anglais)

[fn:6] NdT : Ne connaissant pas ce mot français en voici une définition [[http://www.larousse.fr/dictionnaires/francais/entiercement/29936][Larousse]].

[fn:5] Stolen Account Recovery initiation for Steemit.com users:
07-13-2017 [[https://steemit.com/recover_account_step_1]] (en français
s'il vous plaît)

[fn:4]
Proof-of-Work. Wikipedia. [[https://en.wikipedia.org/wiki/Proof-of-work_system]]
et je me permets d'ajouter cette vidéo dont j'ai fait les sous-titres
[[https://youtu.be/bBC-nXj3Ng4][Bitcoin and Proof-of-Work in 26 minutes]]

[fn:3] Volumes de transaction: transactions par seconde. Steem Témoin
et utilisateur
"@roadscape". [[https://steemit.com/blockchain/@roadscape/tps-report-2-the-flippening]]

[fn:2] Pour le différentier de sa chaîne de blocs, l'orthographe
correcte du jeton numérique natif de Steem est STEEM.

[fn:1] Delegated Proof of Stake Position
Paper. Grigg, 2017. [[https://steemit.com/eos/@iang/seeking-consensus-on-consensus-dpos-or-delegated-proof-of-stake-and-the-%0Atwo-generals-problem]]

