html/steemblupaper.html
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Delegated Proof of Stake Position
Paper. Grigg, 2017. <a href="https://steemit.com/eos/@iang/seeking-consensus-on-consensus-dpos-or-delegated-proof-of-stake-and-the-%0Atwo-generals-problem">https://steemit.com/eos/@iang/seeking-consensus-on-consensus-dpos-or-delegated-proof-of-stake-and-the-
two-generals-problem</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
Pour le différentier de sa chaîne de blocs, l'orthographe
correcte du jeton numérique natif de Steem est STEEM.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
Volumes de transaction: transactions par seconde. Steem Témoin
et utilisateur
"@roadscape". <a href="https://steemit.com/blockchain/@roadscape/tps-report-2-the-flippening">https://steemit.com/blockchain/@roadscape/tps-report-2-the-flippening</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
Proof-of-Work. Wikipedia. <a href="https://en.wikipedia.org/wiki/Proof-of-work_system">https://en.wikipedia.org/wiki/Proof-of-work_system</a>
et je me permets d'ajouter cette vidéo dont j'ai fait les sous-titres
<a href="https://youtu.be/bBC-nXj3Ng4">Bitcoin and Proof-of-Work in 26 minutes</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
Stolen Account Recovery initiation for Steemit.com users:
07-13-2017 <a href="https://steemit.com/recover_account_step_1">https://steemit.com/recover_account_step_1</a> (en français
s'il vous plaît)
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
NdT : Ne connaissant pas ce mot français en voici une définition <a href="http://www.larousse.fr/dictionnaires/francais/entiercement/29936">Larousse</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
NdT : DPoS: <a href="https://www.liskafrica.com/guides/la-preuve-de-participation-d%C3%A9l%C3%A9gu%C3%A9-dpos">Delegateed Proof-of-Stake</a> (expliqué en français) et
<a href="https://hackernoon.com/explain-delegated-proof-of-stake-like-im-5-888b2a74897d">Hackernoon</a> (expliqué en anglais)
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8">8</a></sup> <div class="footpara"><p class="footpara">
NdT : Les mots <i><a href="http://www.wordreference.com/enfr/curators">curator</a></i> ou <i>curation</i> sont particulièrement
chiants à traduire.
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9">9</a></sup> <div class="footpara"><p class="footpara">
Bitcoin Scalability Problem
<a href="https://en.wikipedia.org/wiki/Bitcoin_scalability_problem">https://en.wikipedia.org/wiki/Bitcoin_scalability_problem</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.10" class="footnum" href="#fnr.10">10</a></sup> <div class="footpara"><p class="footpara">
DPoS Whitepaper
<a href="https://steemit.com/dpos/@dantheman/dpos-consensus-algorithm-this-missing-white-paper">https://steemit.com/dpos/@dantheman/dpos-consensus-algorithm-this-missing-white-paper</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.11" class="footnum" href="#fnr.11">11</a></sup> <div class="footpara"><p class="footpara">
<a href="https://steemit.com/steemit/@steemitblog/proposing-hardfork-0-20-0-velocity">https://steemit.com/steemit/@steemitblog/proposing-hardfork-0-20-0-velocity</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.12" class="footnum" href="#fnr.12">12</a></sup> <div class="footpara"><p class="footpara">
ChainBase Release
<a href="https://steemit.com/steem/@steemitblog/announcing-steem-0-14-4-shared-db-preview-release">https://steemit.com/steem/@steemitblog/announcing-steem-0-14-4-shared-db-preview-release</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.13" class="footnum" href="#fnr.13">13</a></sup> <div class="footpara"><p class="footpara">
Graphene Documentation <a href="http://docs.bitshares.org/">http://docs.bitshares.org/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.14" class="footnum" href="#fnr.14">14</a></sup> <div class="footpara"><p class="footpara">
Le composant du cadre (framework) de la chaîne de blocs Steem
responsable du traitement des transactions et de la distribution des
récompenses.
</p></div></div>

<div class="footdef"><sup><a id="fn.15" class="footnum" href="#fnr.15">15</a></sup> <div class="footpara"><p class="footpara">
NdT : l'acronyme API est un peu partout présent sur internet
et comme souvent jamais traduit alors j'en profite ici : <a href="https://fr.wikipedia.org/wiki/Interface_de_programmation">interface de programmation</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.16" class="footnum" href="#fnr.16">16</a></sup> <div class="footpara"><p class="footpara">
Steem Whitepaper <a href="https://steem.io/SteemWhitePaper.pdf">https://steem.io/SteemWhitePaper.pdf</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.17" class="footnum" href="#fnr.17">17</a></sup> <div class="footpara"><p class="footpara">
Bitshares Decentralized Exchange <a href="http://docs.bitshares.org/_downloads/bitshares-general.pdf">http://docs.bitshares.org/_downloads/bitshares-general.pdf</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.18" class="footnum" href="#fnr.18">18</a></sup> <div class="footpara"><p class="footpara">
Steemit.com Currency Market <a href="https://steemit.com/market">https://steemit.com/market</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.19" class="footnum" href="#fnr.19">19</a></sup> <div class="footpara"><p class="footpara">
"Resteem" est le terme utilisé dans la chaîne de blocs Steem
lorsqu'un utilisateur partage le contenu avec ses abonnés. 
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Laurent Garnier</p>
<p class="date">Created: 2018-01-15 Mon 22:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
